app/Controllers/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();
        // CARD SUMMARY
        $totalProduk = $db->table('product')->countAllResults();
        $totalUser = $db->table('user')->countAllResults();
        $totalTransaksi = $db->table('transaction')->countAllResults();
        $omzet = $db->table('transaction')
            ->selectSum('total_harga')
            ->where('status', 2)
            ->get()
            ->getRow();
---
SELECT COUNT(*) AS `numrows`
FROM `product`
SELECT COUNT(*) AS `numrows`
FROM `user`
SELECT COUNT(*) AS `numrows`
FROM `transaction`
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaction`
WHERE `status` = 2

            $jumlahStatus[] = $row['jumlah'];
        }
        // TRANSAKSI TERBARU
        $transaksiTerbaru = $db->table('transaction')
            ->orderBy('id', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `transaction`
ORDER BY `id` DESC
 LIMIT 5