app/Controllers/Home.php

SELECT *
FROM `product`
WHERE `product`.`deleted_at` IS NULL
---
    public function index()
    {
        helper(['number', 'form']);
        // 2. Ambil data produk dari database (sesuaikan dengan kode Anda yang sudah ada)
        $data = [
            'products' => $this->productModel->findAll(),
        ];

SELECT *
FROM `transaction`
WHERE `username` = 'antikbaik'
---
    public function profile()
    {   $username = session()->get('username');
        $data['username'] = $username;
        $buy = $this->transaction->where('username', $username)->findAll();

SELECT *
FROM `transaction`
---
    public function penjualan()
    {
        $data['transactions'] = $this->transaction->findAll();