app/Controllers/LaporanController.php

    public function pendapatan()
    {
        $model = new TransactionModel();
        $tanggal_awal = $this->request->getGet('tanggal_awal');
        $tanggal_akhir = $this->request->getGet('tanggal_akhir');
        $laporan = [];
        if ($tanggal_awal && $tanggal_akhir) {
            $laporan = $model
                ->where('status >=', 1) // only Paid and above
                ->where('created_at >=', $tanggal_awal . ' 00:00:00')
                ->where('created_at <=', $tanggal_akhir . ' 23:59:59')
                ->findAll();
---
SELECT *
FROM `transaction`
WHERE `status` >= 1
AND `created_at` >= '2026-06-01 00:00:00'
AND `created_at` <= '2026-06-30 23:59:59'

    public function arus_kas()
    {
        $db = \Config\Database::connect();
        $queryPenjualan = $db->table('transaction')->selectSum('sudah_dibayar')->get()->getRow();
        $totalPenjualan = $queryPenjualan->sudah_dibayar ?? 0;
        $arusKasModel = new \App\Models\ArusKasModel();
        $dataArusKas = $arusKasModel->orderBy('tanggal', 'ASC')->findAll();
---
SELECT SUM(`sudah_dibayar`) AS `sudah_dibayar`
FROM `transaction`
SELECT *
FROM `arus_kas`
ORDER BY `tanggal` ASC

    public function laba_rugi()
    {
        $db = \Config\Database::connect();
        $request = \Config\Services::request();

        $tanggal_awal = $request->getGet('tanggal_awal');
        $tanggal_akhir = $request->getGet('tanggal_akhir');

        $builderPenjualan = $db->table('transaction');
        if ($tanggal_awal && $tanggal_akhir) {
            $builderPenjualan->where('created_at >=', $tanggal_awal . ' 00:00:00');
            $builderPenjualan->where('created_at <=', $tanggal_akhir . ' 23:59:59');
        }
        $penjualan = $builderPenjualan->selectSum('sudah_dibayar')->get()->getRow()->sudah_dibayar ?? 0;
---
SELECT SUM(`sudah_dibayar`) AS `sudah_dibayar`
FROM `transaction`
WHERE `created_at` >= '2026-06-01 00:00:00'
AND `created_at` <= '2026-06-30 23:59:59'