app/Controllers/ProdukController.php

SELECT *
FROM `product`
WHERE `product`.`deleted_at` IS NULL
---
    public function index()
    {
        return view('produk/index', [
            'products' => $this->productModel->findAll()
        ]);